src/InformationRegisters/ОбменМП_НастройкиРасширения/ОбменМП_НастройкиРасширения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбменМП_НастройкиРасширения</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ОбменМП_НастройкиОбмена</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидНастройки</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ОбменМП_НастройкиОбмена</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ОбменМП_МесяцыНачислений/ОбменМП_МесяцыНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбменМП_МесяцыНачислений</name>
  <comment>Указывает месяцы разрешенные для выгрузки в мобильное приложение</comment>
  <attributes>
    <name>МесяцНачислений</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>УникальныеИдентификаторы</name>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/CommonModules/ОбменМП_СлужебныйВызовСервера/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьНастройкиОбмена() экспорт
	
	НастройкиОбмена = Новый Соответствие();
	
	НастройкиВыборка = РегистрыСведений.ОбменМП_НастройкиРасширения.Выбрать();
	Пока НастройкиВыборка.Следующий() цикл
		НастройкиОбмена.Вставить(НастройкиВыборка.ВидНастройки, НастройкиВыборка.Значение);		
	КонецЦикла;
	
	Возврат НастройкиОбмена;
		
КонецФункции

Функция ПолучитьРазрешенныеЗдания(МассивУникальныхИдентификаторов, Параметры) экспорт
	
	//Преобрзование массива в таблицу для соединения в запросе
	ТаблицаУникальныхИдентификаторов = Новый ТаблицаЗначений();
	ТаблицаУникальныхИдентификаторов.Колонки.Добавить("УникальныйИдентификатор", Новый ОписаниеТипов("УникальныйИдентификатор"));
	Для каждого ИдентификаторИзМассива из МассивУникальныхИдентификаторов цикл
		НоваяСтрока =ТаблицаУникальныхИдентификаторов.Добавить();
		НоваяСтрока.УникальныйИдентификатор = ИдентификаторИзМассива;		
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаУникальныхИдентификаторов.УникальныйИдентификатор
	|ПОМЕСТИТЬ СписокУникальныхИдентификаторов
	|ИЗ
	|	&ТаблицаУникальныхИдентификаторов КАК ТаблицаУникальныхИдентификаторов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбменМП_МесяцыНачисленийУникальныеИдентификаторы.УникальныйИдентификатор,
	|	ОбменМП_МесяцыНачисленийУникальныеИдентификаторы.Ссылка.МесяцНачислений
	|ИЗ
	|	СписокУникальныхИдентификаторов КАК СписокУникальныхИдентификаторов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбменМП_МесяцыНачислений.УникальныеИдентификаторы КАК
	|			ОбменМП_МесяцыНачисленийУникальныеИдентификаторы
	|		ПО ОбменМП_МесяцыНачисленийУникальныеИдентификаторы.УникальныйИдентификатор = СписокУникальныхИдентификаторов.УникальныйИдентификатор";
	
	Запрос.УстановитьПараметр("НачалоПериода", Параметры.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Параметры.КонецПериода));
	Запрос.УстановитьПараметр("ТаблицаУникальныхИдентификаторов", ТаблицаУникальныхИдентификаторов);	
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапрос = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаЗапрос;
		
КонецФункции

#КонецОбласти
